#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/daleksandrowicz-org/terraform-modules-environments-tests/runs/run-hDH6vuayHeTGXXY7

Waiting for the plan to start...

Terraform v1.11.0
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.mongo.mongodbatlas_cluster.cluster-test will be created
  + resource "mongodbatlas_cluster" "cluster-test" {
      + accept_data_risks_and_force_replica_set_reconfig = (known after apply)
      + auto_scaling_compute_enabled                     = (known after apply)
      + auto_scaling_compute_scale_down_enabled          = (known after apply)
      + auto_scaling_disk_gb_enabled                     = (known after apply)
      + backing_provider_name                            = "AWS"
      + backup_enabled                                   = (known after apply)
      + cloud_backup                                     = (known after apply)
      + cluster_id                                       = (known after apply)
      + cluster_type                                     = (known after apply)
      + connection_strings                               = (known after apply)
      + container_id                                     = (known after apply)
      + disk_size_gb                                     = (known after apply)
      + encryption_at_rest_provider                      = (known after apply)
      + id                                               = (known after apply)
      + mongo_db_major_version                           = (known after apply)
      + mongo_db_version                                 = (known after apply)
      + mongo_uri                                        = (known after apply)
      + mongo_uri_updated                                = (known after apply)
      + mongo_uri_with_options                           = (known after apply)
      + name                                             = "Sandbox"
      + num_shards                                       = (known after apply)
      + paused                                           = (known after apply)
      + pit_enabled                                      = (known after apply)
      + project_id                                       = "5fc5407cd17a290e8f5df99b"
      + provider_auto_scaling_compute_max_instance_size  = (known after apply)
      + provider_auto_scaling_compute_min_instance_size  = (known after apply)
      + provider_disk_iops                               = (known after apply)
      + provider_disk_type_name                          = (known after apply)
      + provider_encrypt_ebs_volume                      = (known after apply)
      + provider_encrypt_ebs_volume_flag                 = (known after apply)
      + provider_instance_size_name                      = "M0"
      + provider_name                                    = "TENANT"
      + provider_region_name                             = "US_EAST_1"
      + provider_volume_type                             = (known after apply)
      + redact_client_log_data                           = (known after apply)
      + replication_factor                               = (known after apply)
      + snapshot_backup_policy                           = (known after apply)
      + srv_address                                      = (known after apply)
      + state_name                                       = (known after apply)
      + termination_protection_enabled                   = (known after apply)
      + version_release_system                           = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 1 estimated
           $0.0/mo +$0.0

```

</details>

*Pusher: @daleksandrowicz, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan Lint`*